app/views/teams/show.html.erb

			<tbody>
				<% @team.players.each do |c| %>
---
SELECT "players".* FROM "players" WHERE "players"."team_id" = ?  [["team_id", 3]]

			<tbody>
				<% @team.comments.each do |c| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."team_id" = ?  [["team_id", 3]]