app/views/pages/home.html.erb

  <h1><%= current_user.team.name %></h1>
  <% current_user.team.players.each do |player| %>
---
SELECT  "teams".* FROM "teams" WHERE "teams"."user_id" = ?  ORDER BY "teams"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "players".* FROM "players" WHERE "players"."team_id" = ?  [["team_id", 3]]