app/controllers/comments_controller.rb

  def create
    @team = Team.find(params[:team_id])
    @comment = @team.comments.create(comment_params)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("username", "title", "body", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "TiagoFernandes"], ["title", "Ola"], ["body", "Não percebes nada dissosss"], ["team_id", 3], ["created_at", "2015-06-07 02:43:49.382102"], ["updated_at", "2015-06-07 02:43:49.382102"]]

  def update
    @comment = Comment.find(params[:id])
    @comment.update(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "comments" SET "username" = ?, "title" = ?, "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["username", "ss"], ["title", "ss"], ["body", "ss"], ["updated_at", "2015-06-07 02:44:11.016474"], ["id", 1]]