app/controllers/players_controller.rb

  def create
    @player = Player.create player_params
---
INSERT INTO "players" ("name", "position", "number", "birthday", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Novo"], ["position", "asdasd"], ["number", 24], ["birthday", "1990-07-04"], ["team_id", 3], ["created_at", "2015-06-06 01:36:30.692804"], ["updated_at", "2015-06-06 01:36:30.692804"]]

  def update
    @player = Player.find(params[:id])
    @player.update(player_params)
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "players" SET "number" = ?, "birthday" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["number", 25], ["birthday", "1990-07-06"], ["updated_at", "2015-06-06 01:36:47.272163"], ["id", 7]]

  def destroy
    @player=Player.find(params[:id])
    @player.destroy
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 1]]