app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "TiagoTeam"], ["user_id", 1], ["created_at", "2015-05-21 19:37:37.042314"], ["updated_at", "2015-05-21 19:37:37.042314"]]
---
  def create
    @team = Team.new team_params

    if @team.save

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "teams" SET "name" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["name", "TiagoTeamBest"], ["updated_at", "2015-06-04 11:19:57.982619"], ["id", 3]]
---
  def update
    @team = Team.find(params[:id])
    @team.update(team_params)